gui/Kkit2Documentation.org
Kinetikit 12: Interface for chemical kinetic models in MOOSEGUI.
#+AUTHOR: Upi Bhalla: documentation, Harsha Rani, H. Chaitanya: GUI.

* Introduction
  Kinetikit 12 is a graphical interface for doing chemical kinetic
  modeling in MOOSE. It is derived in part from Kinetikit, which was
  the graphical interface used in GENESIS for similar
  models. Kinetikit, also known as kkit, was at version 11 with
  GENESIS. Here we start with Kinetikit 12.

** What are chemical kinetic models
   A large fraction of neuronal computation occurs through chemical
   signaling.  For example, many forms of synaptic plasticity begin
   with calcium influx into the synapse, followed by calcium binding
   to calmodulin, and then calmodulin activation of numerous
   enzymes. These events can be represented in chemical terms:
#+BEGIN_QUOTE
   4 Ca^{2+} + CaM <---> Ca_4.CaM
#+END_QUOTE
   Such chemical equations can be modeled through standard Ordinary
   Differential Equations, if we ignore space:
#+BEGIN_QUOTE
   d[Ca]/dt = -4 * Kf * [Ca]^4 * [CaM] + 4 * Kb * [Ca_4.CaM]
   d[CaM]/dt = -Kf * [Ca]^4 * [CaM] + Kb * [Ca_4.CaM]
   d[Ca_4.CaM]/dt = Kf * [Ca]^4 * [CaM] - Kb * [Ca_4.CaM]
#+END_QUOTE
   MOOSE models these chemical systems. This help document describes
   how to do such modelling using the graphical interface,
   Kinetikit 2.

** Levels of model
   At present Kinetikit handles compartmental models but does not
   compute diffusion within the compartments, though MOOSE itself can
   do this at the script level. Kkit12 will do deterministic as well
   as stochastic chemical calculations.

** Numerical methods
   + Deterministic :: Adaptive timestep 5th order Runge-Kutta-Fehlberg
                      from the GSL (GNU Scientific Library).
   + Stochastic :: Optimized Gillespie Stochastic Systems Algorithm,
                   custom implementation.

* Using Kinetikit 12

** Overview
   + Load models using File->Load. Chemical schematic appears in
     'Model layout' tab.
   + Run models using 'Run' button.
   + View plots by clicking on 'Plot Window' tab.
   + View parameters in 'Model layout' tab by clicking on icons, and
     looking at entries in 'Properties' table to the right.
   + Edit parameters by changing their values in the 'Properties' table.
   + Plot variables belonging to an object by clicking on its icon,
     and then clicking 'Add Field' in the 'Plot Configuration' panel.
   + Manipulate and save plots using the icons at the bottom of the
     'Plot Window'.

** Model layout and icons
   When you are in the 'Model layout' tab you will see a collection of
   icons, arrows, and grey boxes surrounding these. This is a
   schematic of the reaction scheme being modeled. You can view and
   change parameters, and change the layout of the model. In the next
   MOOSE release you will also be able to add and remove molecules and
   reactions.

*** Compartment
    The 'compartment' in moose is usually but not always contiguous
    domain in which a certain set of chemical reactions and molecular
    species occur. The definition is very closely related to that of a
    cell-biological compartment. Examples include the extracellular
    space, the cell membrane, the cytosol, and the
    nucleus. Compartments can be nested, ways, but of course you
    cannot put a bigger compartment into a smaller one.
    + *Icon* Grey boundary around a set of reactions. 
    + *Compartment editable parameters*
       + Name :: The name of the compartment.
       + Size :: This is the volume, surface area or length of the
                 compartment, depending on its type.

    + *Compartment fixed parameters*
      + numDimensions :: This specifies whether the compartment is a
                          volume, a 2-D surface, or if it is just
                          being represented as a length.
    + *Moving Compartments* Click and drag on the boundary.
    + *Resizing Compartment boundary* Happens automatically when
       contents are repositioned, so that the boundary just contains
       contents.

*** Pool
    This is the set of molecules of a given species within a
    compartment. Different chemical states of the same molecule are
    in different pools.
    + *Icon* Colored rectangle with pool name in it.
    + *Pool editable parameters*
      + Name :: Name of the pool
      + n :: Number of molecules in the pool
      + nInit :: Initial number of molecules in the pool. 'n' gets
                 set to this value when the 'Reinit' operation is
                 done.
      + conc :: Concentration of the molecules in the pool.
                #+BEGIN_QUOTE
                conc = n * unit\_scale\_factor / (NA * vol)
                #+END_QUOTE
      + concInit :: Initial concentration of the molecules in the
                    pool.
                    #+BEGIN_QUOTE
		     concInit = nInit * unit\_scale\_factor / (NA * vol)
                    #+END_QUOTE
		     'conc' is set to this value when the 'Reinit' operation is
                    done.
    + *Pool fixed parameters*
      + size :: Derived from the compartment that holds the
                pool. Specifies volume, surface area or length of the
                holding compartment.
    + *Moving pools* Click and drag.

