Docs/Kkit2Documentation.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Kinetikit 12: Interface for chemical kinetic models in MOOSEGUI.</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Kinetikit 12: Interface for chemical kinetic models in MOOSEGUI."/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-24 14:58:27 IST"/>
<meta name="author" content="Upi Bhalla: documentation, Harsha Rani, H. Chaitanya: GUI."/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Kinetikit 12: Interface for chemical kinetic models in MOOSEGUI.</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a>
<ul>
<li><a href="#sec-1-1">1.1 What are chemical kinetic models</a></li>
<li><a href="#sec-1-2">1.2 Levels of model</a></li>
<li><a href="#sec-1-3">1.3 Numerical methods</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Using Kinetikit 12</a>
<ul>
<li><a href="#sec-2-1">2.1 Overview</a></li>
<li><a href="#sec-2-2">2.2 Model layout and icons</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1 Compartment</a></li>
<li><a href="#sec-2-2-2">2.2.2 Pool</a></li>
<li><a href="#sec-2-2-3">2.2.3 Buffered pools</a></li>
<li><a href="#sec-2-2-4">2.2.4 Reaction</a></li>
<li><a href="#sec-2-2-5">2.2.5 Mass-action enzymes</a></li>
<li><a href="#sec-2-2-6">2.2.6 Michaelis-Menten Enzymes</a></li>
<li><a href="#sec-2-2-7">2.2.7 SumTotal</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3 Model operations</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">

<p>  Kinetikit 12 is a graphical interface for doing chemical kinetic
  modeling in MOOSE. It is derived in part from Kinetikit, which was
  the graphical interface used in GENESIS for similar
  models. Kinetikit, also known as kkit, was at version 11 with
  GENESIS. Here we start with Kinetikit 12.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> What are chemical kinetic models</h3>
<div class="outline-text-3" id="text-1-1">

<p>   A large fraction of neuronal computation occurs through chemical
   signaling.  For example, many forms of synaptic plasticity begin
   with calcium influx into the synapse, followed by calcium binding
   to calmodulin, and then calmodulin activation of numerous
   enzymes. These events can be represented in chemical terms:
</p><blockquote>

<p>4 Ca<sup>2+</sup> + CaM &lt;&mdash;&gt; Ca<sub>4</sub>.CaM
</p>
</blockquote>


<p>
   Such chemical equations can be modeled through standard Ordinary
   Differential Equations, if we ignore space:
</p><blockquote>

<p>d[Ca]/dt = -4 * Kf * [Ca]<sup>4</sup> * [CaM] + 4 * Kb * [Ca<sub>4</sub>.CaM]
d[CaM]/dt = -Kf * [Ca]<sup>4</sup> * [CaM] + Kb * [Ca<sub>4</sub>.CaM]
d[Ca<sub>4</sub>.CaM]/dt = Kf * [Ca]<sup>4</sup> * [CaM] - Kb * [Ca<sub>4</sub>.CaM]
</p>
</blockquote>


<p>
   MOOSE models these chemical systems. This help document describes
   how to do such modelling using the graphical interface,
   Kinetikit 2.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Levels of model</h3>
<div class="outline-text-3" id="text-1-2">

<p>   At present Kinetikit handles compartmental models but does not
   compute diffusion within the compartments, though MOOSE itself can
   do this at the script level. Kkit12 will do deterministic as well
   as stochastic chemical calculations.
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Numerical methods</h3>
<div class="outline-text-3" id="text-1-3">

<dl>
<dt>Deterministic</dt><dd>Adaptive timestep 5th order Runge-Kutta-Fehlberg
                      from the GSL (GNU Scientific Library).
</dd>
<dt>Stochastic</dt><dd>Optimized Gillespie Stochastic Systems Algorithm,
                   custom implementation.
</dd>
</dl>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Using Kinetikit 12</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Overview</h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li>Load models using File-&gt;Load. Chemical schematic appears in
     'Model layout' tab.
</li>
<li>Run models using 'Run' button.
</li>
<li>View plots by clicking on 'Plot Window' tab.
</li>
<li>View parameters in 'Model layout' tab by clicking on icons, and
     looking at entries in 'Properties' table to the right.
</li>
<li>Edit parameters by changing their values in the 'Properties' table.
</li>
<li>Plot variables belonging to an object by clicking on its icon,
     and then clicking 'Add Field' in the 'Plot Configuration' panel.
</li>
<li>Manipulate and save plots using the icons at the bottom of the
     'Plot Window'.
</li>
</ul>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Model layout and icons</h3>
<div class="outline-text-3" id="text-2-2">

<p>   When you are in the 'Model layout' tab you will see a collection of
   icons, arrows, and grey boxes surrounding these. This is a
   schematic of the reaction scheme being modeled. You can view and
   change parameters, and change the layout of the model. In the next
   MOOSE release you will also be able to add and remove molecules and
   reactions.
</p>

</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Compartment</h4>
<div class="outline-text-4" id="text-2-2-1">

<p>    The 'compartment' in moose is usually but not always contiguous
    domain in which a certain set of chemical reactions and molecular
    species occur. The definition is very closely related to that of a
    cell-biological compartment. Examples include the extracellular
    space, the cell membrane, the cytosol, and the
    nucleus. Compartments can be nested, ways, but of course you
    cannot put a bigger compartment into a smaller one.
</p><ul>
<li><b>Icon</b> Grey boundary around a set of reactions. 
</li>
<li><b>Compartment editable parameters</b>
<dl>
<dt>Name</dt><dd>The name of the compartment.
</dd>
<dt>Size</dt><dd>This is the volume, surface area or length of the
                 compartment, depending on its type.

</dd>
</dl>

</li>
<li><b>Compartment fixed parameters</b>
<dl>
<dt>numDimensions</dt><dd>This specifies whether the compartment is a
                          volume, a 2-D surface, or if it is just
                          being represented as a length.
</dd>
</dl>

</li>
<li><b>Moving Compartments</b> Click and drag on the boundary.
</li>
<li><b>Resizing Compartment boundary</b> Happens automatically when
       contents are repositioned, so that the boundary just contains
       contents.
</li>
</ul>


</div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Pool</h4>
<div class="outline-text-4" id="text-2-2-2">

<p>    This is the set of molecules of a given species within a
    compartment. Different chemical states of the same molecule are
    in different pools.
</p><ul>
<li><b>Icon</b> Colored rectangle with pool name in it.
</li>
<li><b>Pool editable parameters</b>
<dl>
<dt>Name</dt><dd>Name of the pool
</dd>
<dt>n</dt><dd>Number of molecules in the pool
</dd>
<dt>nInit</dt><dd>Initial number of molecules in the pool. 'n' gets
                 set to this value when the 'Reinit' operation is
                 done.
</dd>
<dt>conc</dt><dd>Concentration of the molecules in the pool.
<blockquote>

<p>conc = n * unit_scale_factor / (NA * vol)
</p>
</blockquote>


</dd>
<dt>concInit</dt><dd>Initial concentration of the molecules in the
                    pool.
<blockquote>

<p>concInit = nInit * unit_scale_factor / (NA * vol)
</p>
</blockquote>


<p>
                     'conc' is set to this value when the 'Reinit' operation is
                    done.
</p></dd>
</dl>

</li>
<li><b>Pool fixed parameters</b>
<dl>
<dt>size</dt><dd>Derived from the compartment that holds the
                pool. Specifies volume, surface area or length of the
                holding compartment.
</dd>
</dl>

</li>
<li><b>Moving pools</b> Click and drag.
</li>
</ul>


</div>

</div>
