gui/Kkit2Documentation.org
*** Buffered pools
    Some pools are set to a fixed n and concentration throughout a
    simulation. These are buffered pools.
    + *Icon* Colored rectangle with pool name in it.
    + *Buffered Pool editable parameters*
      + Name :: Name of the pool
      + nInit :: Fixed number of molecules in the pool.  'n' gets set
                 to this value throughout the run.
      + concInit :: Fixed concentration of the molecules in
		     the pool.
        #+BEGIN_QUOTE
	 concInit = nInit * unit\_scale\_factor / (NA * vol)
	 #+END_QUOTE
     'conc' is set to this value throughout the run.
    + *Pool fixed parameters*
      + n :: Number of molecules in the pool. Derived from 'nInit'.
      + conc :: Concentration of molecules in the pool.  Derived from
                'concInit'.
      + size :: Derived from the compartment that holds the
                pool. Specifies volume, surface area or length of the
                holding compartment.
    + *Moving Buffered pools* Click and drag.

*** Reaction
    These are conversion reactions between sets of pools.  They are
    reversible, but you can set either of the rates to zero to get
    irreversibility.
    + *Icon* Reversible reaction arrow.
    + *Reaction editable parameters*
      + *Name* Name of reaction
      + *Kf* Forward rate of reaction, in concentration/time
        units. This is the normal way to express and manipulate the
        reaction rate.
      + *kf* Forward rate of reaction, in number/time units. This is
        used internally for computations, but is volume-dependent and
        should not be used to manipulate the reaction rate unless you
        really know what you are doing.
      + *Kb* Backward rate of reaction, in concentration/time
        units. This is the normal way to express and manipulate the
        reaction rate.
      + *kb* Backward rate of reaction, in number/time units. This is
        used internally for computations, but is volume-dependent and
        should not be used to manipulate the reaction rate unless you
        really know what you are doing.
    + *Reaction fixed parameters*
      + numProducts :: Number of product molecules
      + numSubstrates :: Number of substrates molecules
    + *Moving Reactions* Click and drag.

*** Mass-action enzymes
    These are enzymes that model the chemical equations
    #+BEGIN_QUOTE
    E + S <===> E.S ---> E + P
    #+END_QUOTE
    Note that the second reaction is irreversible. Note also that
    mass-action enzymes require the creation of a pool to represent
    the E.S (enzyme-substrate) complex.

    + *Icon* Colored ellipse atop a small square. The ellipse
      represents the enzyme The small square represents E.S, the
      enzyme-substrate complex.

      The ellipse icon has the same color as the enzyme E.  It is
      connected to the enzyme pool E with a straight line of the same
      color.

      The ellipse icon sits on a continuous, typically curved arrow
      in red, from the substrate to the product.

      A given enzyme pool can have any number of enzyme activities,
      since the same enzyme might catalyze many reactions.

    + *Enzyme editable parameters*
      + Name :: Name of enzyme.
      + Km :: Michaelis-Menten value for enzyme, in concentration units.
      + kcat :: Production rate of enzyme, in 1/time units.  Equal to
               k3, the rate of the second, irreversible reaction.
      + k1 :: Forward rate of the E+S reaction, in number and 1/time
              units. This is what is used in the internal calculations.
      + k2 :: Backward rate of the E+S reaction, in 1/time units. Used
              in internal calculations.
      + k3 :: Forward rate of the E.S---> E + P reaction, in 1/time
              units. Equivalent to kcat.  Used in internal
              calculations.
      + ratio :: Ratio of k2/k3. Needed to define the internal rates
                 in terms of Km and kcat. I usually use a value of 4.

    + *Enzyme-substrate-complex editable parameters* 
 
      These are identical to those of any other pool.
      + Name :: Name of the E.S complex. Defaults to
       '<enzymeName>\_cplx'.
      + n :: Number of molecules in the pool
      + nInit :: Initial number of molecules in the complex.  'n' gets
                set to this value when the 'Reinit' operation is done.
      + conc :: Concentration of the molecules in the pool.
       #+BEGIN_QUOTE
       conc = n * unit\_scale\_factor / (NA * vol)
       #+END_QUOTE
      + concInit :: Initial concentration of the molecules in 
 		  the pool.
                   #+BEGIN_QUOTE
 		  concInit = nInit * unit\_scale\_factor / (NA * vol)
                   #+END_QUOTE
 		  'conc' is set to this value when the 'Reinit'
                   operation is done.

    + *Enzyme-substrate-complex fixed parameters*
      + size :: Derived from the compartment that holds the
      pool. Specifies volume, surface area or length of the holding
      compartment. Note that the Enzyme-substrate-complex is assumed
      to be in the same compartment as the enzyme molecule.

    + *Moving Enzymes* Click and drag on the ellipse.
     
*** Michaelis-Menten Enzymes
    These are enzymes that obey the 
    Michaelis-Menten equation
    #+BEGIN_QUOTE
    V = Vmax*[S]/(Km+[S]) = kcat*[Etot]*[S]/(Km+[S])
    where Vmax is the maximum rate of the enzyme,
    [Etot] is the total amount of the enzyme
    Km is the Michaelis-Menten constant
    S is the substrate.
    #+END_QUOTE
    Nominally these enzymes model the same chemical equation as the
    mass-action enzyme:
    #+BEGIN_QUOTE
    E + S <===> E.S ---> E + P
    #+END_QUOTE
    but they make the assumption that the E.S is in a quasi-
    steady-state with E and S, and they also ignore sequestration of
    the enzyme into the complex. So there is no representation of the
    E.S complex.
    + *Icon* Colored ellipse. The ellipse represents the enzyme The
      ellipse icon has the same color as the enzyme E.  It is
      connected to the enzyme pool E with a straight line of the same
      color.  The ellipse icon sits on a continuous, typically curved
      arrow in red, from the substrate to the product.  A given
      enzyme pool can have any number of enzyme activities, since the
      same enzyme might catalyze many reactions.
    + *Enzyme editable parameters*
       + Name :: Name of enzyme.
       + Km :: Michaelis-Menten value for enzyme, in concentration
            units.
       + kcat :: Production rate of enzyme, in 1/time units.  Equal to
              k3, the rate of the second, irreversible reaction.
    + *Moving Enzymes* Click and drag.

