Docs/Kkit2Documentation.html

<div id="outline-container-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> Buffered pools</h4>
<div class="outline-text-4" id="text-2-2-3">

<p>    Some pools are set to a fixed n and concentration throughout a
    simulation. These are buffered pools.
</p><ul>
<li><b>Icon</b> Colored rectangle with pool name in it.
</li>
<li><b>Buffered Pool editable parameters</b>
<dl>
<dt>Name</dt><dd>Name of the pool
</dd>
<dt>nInit</dt><dd>Fixed number of molecules in the pool.  'n' gets set
                 to this value throughout the run.
</dd>
<dt>concInit</dt><dd>Fixed concentration of the molecules in
                     the pool.
<blockquote>

<p>concInit = nInit * unit_scale_factor / (NA * vol)
</p>
</blockquote>


</dd>
</dl>

<p>     'conc' is set to this value throughout the run.
</p></li>
<li><b>Pool fixed parameters</b>
<dl>
<dt>n</dt><dd>Number of molecules in the pool. Derived from 'nInit'.
</dd>
<dt>conc</dt><dd>Concentration of molecules in the pool.  Derived from
                'concInit'.
</dd>
<dt>size</dt><dd>Derived from the compartment that holds the
                pool. Specifies volume, surface area or length of the
                holding compartment.
</dd>
</dl>

</li>
<li><b>Moving Buffered pools</b> Click and drag.
</li>
</ul>


</div>

</div>

<div id="outline-container-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4">2.2.4</span> Reaction</h4>
<div class="outline-text-4" id="text-2-2-4">

<p>    These are conversion reactions between sets of pools.  They are
    reversible, but you can set either of the rates to zero to get
    irreversibility.
</p><ul>
<li><b>Icon</b> Reversible reaction arrow.
</li>
<li><b>Reaction editable parameters</b>
<ul>
<li><b>Name</b> Name of reaction
</li>
<li><b>Kf</b> Forward rate of reaction, in concentration/time
        units. This is the normal way to express and manipulate the
        reaction rate.
</li>
<li><b>kf</b> Forward rate of reaction, in number/time units. This is
        used internally for computations, but is volume-dependent and
        should not be used to manipulate the reaction rate unless you
        really know what you are doing.
</li>
<li><b>Kb</b> Backward rate of reaction, in concentration/time
        units. This is the normal way to express and manipulate the
        reaction rate.
</li>
<li><b>kb</b> Backward rate of reaction, in number/time units. This is
        used internally for computations, but is volume-dependent and
        should not be used to manipulate the reaction rate unless you
        really know what you are doing.
</li>
</ul>

</li>
<li><b>Reaction fixed parameters</b>
<dl>
<dt>numProducts</dt><dd>Number of product molecules
</dd>
<dt>numSubstrates</dt><dd>Number of substrates molecules
</dd>
</dl>

</li>
<li><b>Moving Reactions</b> Click and drag.
</li>
</ul>


</div>

</div>

<div id="outline-container-2-2-5" class="outline-4">
<h4 id="sec-2-2-5"><span class="section-number-4">2.2.5</span> Mass-action enzymes</h4>
<div class="outline-text-4" id="text-2-2-5">

<p>    These are enzymes that model the chemical equations
</p><blockquote>

<p>E + S &lt;===&gt; E.S &mdash;&gt; E + P
</p>
</blockquote>


<p>
    Note that the second reaction is irreversible. Note also that
    mass-action enzymes require the creation of a pool to represent
    the E.S (enzyme-substrate) complex.
</p>
<ul>
<li><b>Icon</b> Colored ellipse atop a small square. The ellipse
      represents the enzyme The small square represents E.S, the
      enzyme-substrate complex.

<p>
      The ellipse icon has the same color as the enzyme E.  It is
      connected to the enzyme pool E with a straight line of the same
      color.
</p>
<p>
      The ellipse icon sits on a continuous, typically curved arrow
      in red, from the substrate to the product.
</p>
<p>
      A given enzyme pool can have any number of enzyme activities,
      since the same enzyme might catalyze many reactions.
</p>
</li>
<li><b>Enzyme editable parameters</b>
<dl>
<dt>Name</dt><dd>Name of enzyme.
</dd>
<dt>Km</dt><dd>Michaelis-Menten value for enzyme, in concentration units.
</dd>
<dt>kcat</dt><dd>Production rate of enzyme, in 1/time units.  Equal to
               k3, the rate of the second, irreversible reaction.
</dd>
<dt>k1</dt><dd>Forward rate of the E+S reaction, in number and 1/time
              units. This is what is used in the internal calculations.
</dd>
<dt>k2</dt><dd>Backward rate of the E+S reaction, in 1/time units. Used
              in internal calculations.
</dd>
<dt>k3</dt><dd>Forward rate of the E.S&mdash;&gt; E + P reaction, in 1/time
              units. Equivalent to kcat.  Used in internal
              calculations.
</dd>
<dt>ratio</dt><dd>Ratio of k2/k3. Needed to define the internal rates
                 in terms of Km and kcat. I usually use a value of 4.

</dd>
</dl>

</li>
<li><b>Enzyme-substrate-complex editable parameters</b> 

<p> 
      These are identical to those of any other pool.
</p><dl>
<dt>Name</dt><dd>Name of the E.S complex. Defaults to
       '&lt;enzymeName&gt;_cplx'.
</dd>
<dt>n</dt><dd>Number of molecules in the pool
</dd>
<dt>nInit</dt><dd>Initial number of molecules in the complex.  'n' gets
                set to this value when the 'Reinit' operation is done.
</dd>
<dt>conc</dt><dd>Concentration of the molecules in the pool.
<blockquote>

<p>conc = n * unit_scale_factor / (NA * vol)
</p>
</blockquote>


</dd>
<dt>concInit</dt><dd>Initial concentration of the molecules in 
                  the pool.
<blockquote>

<p>concInit = nInit * unit_scale_factor / (NA * vol)
</p>
</blockquote>


<p>
                  'conc' is set to this value when the 'Reinit'
                   operation is done.
</p>
</dd>
</dl>

</li>
<li><b>Enzyme-substrate-complex fixed parameters</b>
<dl>
<dt>size</dt><dd>Derived from the compartment that holds the
</dd>
</dl>

<p>      pool. Specifies volume, surface area or length of the holding
      compartment. Note that the Enzyme-substrate-complex is assumed
      to be in the same compartment as the enzyme molecule.
</p>
</li>
<li><b>Moving Enzymes</b> Click and drag on the ellipse.
</li>
</ul>


</div>

</div>

<div id="outline-container-2-2-6" class="outline-4">
<h4 id="sec-2-2-6"><span class="section-number-4">2.2.6</span> Michaelis-Menten Enzymes</h4>
<div class="outline-text-4" id="text-2-2-6">

<p>    These are enzymes that obey the 
    Michaelis-Menten equation
</p><blockquote>

<p>V = Vmax*[S]/(Km+[S]) = kcat*[Etot]*[S]/(Km+[S])
where Vmax is the maximum rate of the enzyme,
[Etot] is the total amount of the enzyme
Km is the Michaelis-Menten constant
S is the substrate.
</p>
</blockquote>


<p>
    Nominally these enzymes model the same chemical equation as the
    mass-action enzyme:
</p><blockquote>

<p>E + S &lt;===&gt; E.S &mdash;&gt; E + P
</p>
</blockquote>


<p>
    but they make the assumption that the E.S is in a quasi-
    steady-state with E and S, and they also ignore sequestration of
    the enzyme into the complex. So there is no representation of the
    E.S complex.
</p><ul>
<li><b>Icon</b> Colored ellipse. The ellipse represents the enzyme The
      ellipse icon has the same color as the enzyme E.  It is
      connected to the enzyme pool E with a straight line of the same
      color.  The ellipse icon sits on a continuous, typically curved
      arrow in red, from the substrate to the product.  A given
      enzyme pool can have any number of enzyme activities, since the
      same enzyme might catalyze many reactions.
</li>
<li><b>Enzyme editable parameters</b>
<dl>
<dt>Name</dt><dd>Name of enzyme.
</dd>
<dt>Km</dt><dd>Michaelis-Menten value for enzyme, in concentration
            units.
</dd>
<dt>kcat</dt><dd>Production rate of enzyme, in 1/time units.  Equal to
              k3, the rate of the second, irreversible reaction.
</dd>
</dl>

</li>
<li><b>Moving Enzymes</b> Click and drag.
</li>
</ul>


</div>

</div>
