gui/Kkit2Documentation.org
*** SumTotal
    This is a pool whose concentration is just the sum of
    the concentrations of pools connected into it.  It behaves like a
    buffer whose concentration varies as the simulation proceeds Note
    that this violates mass conservation: One can use a SumTotal in a
    reaction, just like a buffer, but the SumTotal itself will never
    be depleted. Typically used when we have multiple molecular forms
    of an enzyme, all with similar activity, and we just want to use
    a single enzyme activity to represent the whole lot.

    + *Icon* Colored rectangle with pool name. The input pools
      connect to the SumTotal with blue arrows.

    + *SumTotal editable parameters*
      + Name :: Name of the pool

    + *Pool fixed parameters*
      + n :: Number of molecules in the pool. Computed as it runs.
      + conc :: Concentration of molecules in the pool.  Computed as it
             runs.
      + size :: Derived from the compartment that holds the
             pool. Specifies volume, surface area or length of the
             holding compartment.

    + *Moving SumTotals* Click and drag.
  
** Model operations
   - *Loading models* File->Load Model-> select from dialog.  This
     operation deletes the previously loaded model.  Currently only
     understands Kkit.g format models.
   - *Saving models* File->Save Model->select from dialog.
     Currently only understands Kkit.g format models.
   - *Merging models* File->Merge Model -> select from dialog. This
     operation tries to merge the new model into the currently loaded
     model. It does so by recognizing existing molecular pool names,
     and not duplicating those. Instead, any new reactions involving
     the existing pools get tied into the existing model. All other
     new pools and reactions are created as usual. Note that
     parameters of existing pools get updated to values from the new
     model.
   - *Changing numerical methods* Solver menu item in title bar has
     options. Currently supports:
     + Runge Kutta :: This is the Runge-Kutta-Fehlberg implementation
                      from the Gnu Scientific Library (GSL). It is a
                      fifth order variable timestep explicit
                      method. Works well for most reaction systems
                      except if they have very stiff reactions.
     + Gillespie :: Optimized Gillespie Stochastic Systems Algorithm,
                    custom implementation. This uses variable timesteps
                    internally.  Note that it slows down with
                    increasing numbers of molecules in each pool. It
                    also slows down, but not so badly, if the number of
                    reactions goes up.
  
