Docs/Kkit2Documentation.html

<div id="outline-container-2-2-7" class="outline-4">
<h4 id="sec-2-2-7"><span class="section-number-4">2.2.7</span> SumTotal</h4>
<div class="outline-text-4" id="text-2-2-7">

<p>    This is a pool whose concentration is just the sum of
    the concentrations of pools connected into it.  It behaves like a
    buffer whose concentration varies as the simulation proceeds Note
    that this violates mass conservation: One can use a SumTotal in a
    reaction, just like a buffer, but the SumTotal itself will never
    be depleted. Typically used when we have multiple molecular forms
    of an enzyme, all with similar activity, and we just want to use
    a single enzyme activity to represent the whole lot.
</p>
<ul>
<li><b>Icon</b> Colored rectangle with pool name. The input pools
      connect to the SumTotal with blue arrows.

</li>
<li><b>SumTotal editable parameters</b>
<dl>
<dt>Name</dt><dd>Name of the pool

</dd>
</dl>

</li>
<li><b>Pool fixed parameters</b>
<dl>
<dt>n</dt><dd>Number of molecules in the pool. Computed as it runs.
</dd>
<dt>conc</dt><dd>Concentration of molecules in the pool.  Computed as it
             runs.
</dd>
<dt>size</dt><dd>Derived from the compartment that holds the
             pool. Specifies volume, surface area or length of the
             holding compartment.

</dd>
</dl>

</li>
<li><b>Moving SumTotals</b> Click and drag.
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Model operations</h3>
<div class="outline-text-3" id="text-2-3">

<ul>
<li><b>Loading models</b> File-&gt;Load Model-&gt; select from dialog.  This
     operation deletes the previously loaded model.  Currently only
     understands Kkit.g format models.
</li>
<li><b>Saving models</b> File-&gt;Save Model-&gt;select from dialog.
     Currently only understands Kkit.g format models.
</li>
<li><b>Merging models</b> File-&gt;Merge Model -&gt; select from dialog. This
     operation tries to merge the new model into the currently loaded
     model. It does so by recognizing existing molecular pool names,
     and not duplicating those. Instead, any new reactions involving
     the existing pools get tied into the existing model. All other
     new pools and reactions are created as usual. Note that
     parameters of existing pools get updated to values from the new
     model.
</li>
<li><b>Changing numerical methods</b> Solver menu item in title bar has
     options. Currently supports:
<dl>
<dt>Runge Kutta</dt><dd>This is the Runge-Kutta-Fehlberg implementation
                      from the Gnu Scientific Library (GSL). It is a
                      fifth order variable timestep explicit
                      method. Works well for most reaction systems
                      except if they have very stiff reactions.
</dd>
<dt>Gillespie</dt><dd>Optimized Gillespie Stochastic Systems Algorithm,
                    custom implementation. This uses variable timesteps
                    internally.  Note that it slows down with
                    increasing numbers of molecules in each pool. It
                    also slows down, but not so badly, if the number of
                    reactions goes up.
</dd>
</dl>

</li>
</ul>


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-09-24 14:58:27 IST</p>
<p class="author">Author: Upi Bhalla: documentation, Harsha Rani, H. Chaitanya: GUI.</p>
<p class="creator">Org version 7.8.11 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
